# 1. Pandas Series

In [65]:
import pandas as pd

In [68]:
name = ['Rohan','Joseph','Rohit'] #create a list
name

['Rohan', 'Joseph', 'Rohit']

In [67]:
type(name)

list

In [70]:
name = pd.Series(name) #convert to pandas series
name

0     Rohan
1    Joseph
2     Rohit
dtype: object

In [69]:
type(name)
name

['Rohan', 'Joseph', 'Rohit']

In [493]:
#convert dictionary to series
sport = {'cricket' : 'India',
        'soccer' : 'UK',
        'Football' : 'USA'}

sport = pd.Series(sport)
sport

cricket     India
soccer         UK
Football      USA
dtype: object

In [494]:
sport.index #check index of series

Index(['cricket', 'soccer', 'Football'], dtype='object')

# 2. Querying a pandas series

In [495]:
sport = {'cricket' : 'India',
        'soccer' : 'UK',
        'Football' : 'USA'}

sport = pd.Series(sport)
sport

cricket     India
soccer         UK
Football      USA
dtype: object

In [496]:
#Return the value in the second row
sport.iloc[2]

'USA'

In [497]:
#Return the value based on index 
sport.loc['Football']

'USA'

In [498]:
sport[2] #returns value in second row

'USA'

In [499]:
sport['Football'] #returns value where index is Football

'USA'

In [500]:
sports = {99: 'Bhutan',
          100: 'Scotland',
          101: 'Japan',
          102: 'South Korea'}
s = pd.Series(sports)

In [501]:
#s[0] will throw an error as index is numeric
s.iloc[3] #returns value in 3rd row

'South Korea'

In [502]:
#create pandas series without index
a = pd.Series([1,2,3])
print(a)

0    1
1    2
2    3
dtype: int64

In [503]:
#Let's sum the values in the series
b=0
for i in a:
    b+=i
print(b)

6

In [73]:
a = pd.Series([1,2,3])
sum(a)

6

In [504]:
import numpy as np
np.sum(a)

6

In [505]:
#create a big list of random numbers
b =pd.Series(np.random.randint(1,100,100))

In [506]:
len(b)

100

In [507]:
%%timeit -n 100 #calculate time taken for a for loop calculation
s = 0
for i in b:
    s+=i

30.3 µs ± 1.64 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [508]:
%%timeit -n 100
np.sum(b)

134 µs ± 12.1 µs per loop (mean ± std. dev. of 7 runs, 100 loops each)

In [509]:
#Add 2 to every number in series
b+=2
b

0      16
1      44
2      30
3      98
4      93
5       6
6      75
7      20
8      16
9       7
10     86
11     23
12     44
13     10
14     98
15     79
16     99
17     89
18     55
19     36
20     58
21     30
22     88
23     55
24     67
25     71
26     52
27     92
28     64
29     62
     ...
70     61
71     53
72     15
73     32
74    100
75     47
76     59
77     57
78     14
79     78
80     53
81     78
82     73
83     42
84     55
85     18
86     52
87     10
88     75
89     71
90     95
91    100
92      5
93     20
94     40
95     69
96     42
97     41
98     93
99     36
Length: 100, dtype: int32

In [52]:
#Add data to existing series
a = pd.Series([1,2,3])
a.loc['City'] = 'Delhi'

In [511]:
print(a)

0           1
1           2
2           3
City    Delhi
dtype: object

In [512]:
#Multiple objects in series can have same index
b = pd.Series(['a','b','c','d'],index=['e','e','e','e'])

In [513]:
print(b)

e    a
e    b
e    c
e    d
dtype: object

In [514]:
#Access data with index as e
b.loc['e']

e    a
e    b
e    c
e    d
dtype: object

# 3. Pandas dataframe

In [13]:
#create a pandas dataframe
df1 = pd.DataFrame([{'Name' : 'John', 'Occupation' :  'Data Scientist', 'Age' : 25},
                  {'Name' : 'David', 'Occupation' :  'Analyst', 'Age' : 28},
                  {'Name' : 'Mark', 'Occupation' :  'Teacher', 'Age' : 30}],
                   index=['1','2','3'] )
df1

   Age   Name      Occupation
1   25   John  Data Scientist
2   28  David         Analyst
3   30   Mark         Teacher

In [515]:
s1 = pd.Series({'Name' : 'Rohan',
                   'Age':'25'})
s2 = pd.Series({'Name' : 'Rohit',
                'Age' : 28})

In [516]:
#convert series to dataframe
df1 = pd.DataFrame([s1,s2],index=['1','2'])
df1

    Name Age
1  Rohan  25
2  Rohit  28

In [517]:
#Access first row
df1.loc['1']

Name    Rohan
Age        25
Name: 1, dtype: object

In [518]:
#Transpose dataframe
df1.T

          1      2
Name  Rohan  Rohit
Age      25     28

In [519]:
df1.loc['1']['Name'] #Access first name

'Rohan'

In [520]:
df1.loc['2']['Age'] #Access 2nd age

28

In [521]:
#drop a row based on index
df1.drop('1')

    Name Age
2  Rohit  28

In [522]:
df2 = df1.copy() #copy dataframe to another object
df2

    Name Age
1  Rohan  25
2  Rohit  28

In [523]:
del df2['Name'] #delete a column from the pandas dataframe
df2

  Age
1  25
2  28

In [85]:
df1 = pd.DataFrame([{'Name' : 'Rohan','Age':25},{'Name' : 'Rohit','Age' : 28}],index={'1','2'})
df1

   Age   Name
1   25  Rohan
2   28  Rohit

# 4. Pandas reading and writing csv

In [611]:
#upload a csv file
iris = pd.read_csv('C:\\Users\\rohan\\Documents\\Analytics\\Data\\iris.csv')

In [612]:
#view top 5 rows of csv
iris.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth    Name
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

In [539]:
#View the column names
iris.columns

Index(['SepalLength', 'SepalWidth', 'PetalLength', 'PetalWidth', 'Name'], dtype='object')

In [553]:
#rename a column
check = iris
check = check.rename(columns={'SepalLength':'New_name'}).head()

In [554]:
#save the csv file into your directory
check.to_csv('iris2.csv')

# 5. Querying a dataframe

In [86]:
#Access first row
df1.loc['1']

Age        25
Name    Rohan
Name: 1, dtype: object

In [87]:
#Transpose dataframe
df1.T

          1      2
Age      25     28
Name  Rohan  Rohit

In [519]:
df1.loc['1']['Name'] #Access first name

'Rohan'

In [520]:
df1.loc['2']['Age'] #Access 2nd age

28

In [521]:
#drop a row based on index
df1.drop('1')

    Name Age
2  Rohit  28

In [522]:
df2 = df1.copy() #copy dataframe to another object
df2

    Name Age
1  Rohan  25
2  Rohit  28

In [523]:
del df2['Name'] #delete a column from the pandas dataframe
df2

  Age
1  25
2  28

In [609]:
#count number of unique species
iris['Name'].nunique()

3

In [610]:
#List the unique species
iris['Name'].unique()

array(['setosa', 'versicolor', 'virginica'], dtype=object)

In [614]:
#Number of rows in data
len(iris)

150

# 6. Indexing dataframes

In [32]:
#Check existing index
iris.index.values

array([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,  10,  11,  12,
        13,  14,  15,  16,  17,  18,  19,  20,  21,  22,  23,  24,  25,
        26,  27,  28,  29,  30,  31,  32,  33,  34,  35,  36,  37,  38,
        39,  40,  41,  42,  43,  44,  45,  46,  47,  48,  49,  50,  51,
        52,  53,  54,  55,  56,  57,  58,  59,  60,  61,  62,  63,  64,
        65,  66,  67,  68,  69,  70,  71,  72,  73,  74,  75,  76,  77,
        78,  79,  80,  81,  82,  83,  84,  85,  86,  87,  88,  89,  90,
        91,  92,  93,  94,  95,  96,  97,  98,  99, 100, 101, 102, 103,
       104, 105, 106, 107, 108, 109, 110, 111, 112, 113, 114, 115, 116,
       117, 118, 119, 120, 121, 122, 123, 124, 125, 126, 127, 128, 129,
       130, 131, 132, 133, 134, 135, 136, 137, 138, 139, 140, 141, 142,
       143, 144, 145, 146, 147, 148, 149], dtype=int64)

In [90]:
#Change index to 'Name'
b = iris.set_index('Name')
b.head()

        SepalLength  SepalWidth  PetalLength  PetalWidth
Name
setosa          5.1         3.5          1.4         0.2
setosa          4.9         3.0          1.4         0.2
setosa          4.7         3.2          1.3         0.2
setosa          4.6         3.1          1.5         0.2
setosa          5.0         3.6          1.4         0.2

In [93]:
#Go back to your originial index
c = b.reset_index()
c.head()

     Name  SepalLength  SepalWidth  PetalLength  PetalWidth
0  setosa          5.1         3.5          1.4         0.2
1  setosa          4.9         3.0          1.4         0.2
2  setosa          4.7         3.2          1.3         0.2
3  setosa          4.6         3.1          1.5         0.2
4  setosa          5.0         3.6          1.4         0.2

# 7. Merging dataframes

In [97]:
#Now let's import the classic iris dataset
import os
os.chdir('C:\\Users\\rohan\\Documents\\Analytics\\Data')

df1 = pd.read_csv('iris.csv')

In [26]:
df1.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth    Name
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

In [94]:
#create a new dataframe to merge
df2 = pd.DataFrame([{'Name' : 'setosa', 'Species' : 'Species 1'},
                  {'Name':'versicolor','Species':'Species 2'},
                   {'Name':'virginica','Species':'Species 3'}])
df2

         Name    Species
0      setosa  Species 1
1  versicolor  Species 2
2   virginica  Species 3

In [31]:
#Merge the above two datasets
df3 = pd.merge(df1,df2,how='inner',left_on='Name',right_on='Name')
df3.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth    Name    Species
0          5.1         3.5          1.4         0.2  setosa  Species 1
1          4.9         3.0          1.4         0.2  setosa  Species 1
2          4.7         3.2          1.3         0.2  setosa  Species 1
3          4.6         3.1          1.5         0.2  setosa  Species 1
4          5.0         3.6          1.4         0.2  setosa  Species 1

# 8. Aggregate function

In [98]:
df1.head()

   SepalLength  SepalWidth  PetalLength  PetalWidth    Name
0          5.1         3.5          1.4         0.2  setosa
1          4.9         3.0          1.4         0.2  setosa
2          4.7         3.2          1.3         0.2  setosa
3          4.6         3.1          1.5         0.2  setosa
4          5.0         3.6          1.4         0.2  setosa

In [99]:
#Aggregate average of Sepal Length for each Species
df1.groupby('Name')['SepalLength'].mean()

Name
setosa        5.006
versicolor    5.936
virginica     6.588
Name: SepalLength, dtype: float64

In [38]:
#Aggregate average of all the numerical columns for each Species
df1.groupby('Name')[['SepalLength','SepalWidth','PetalLength','PetalWidth']].mean()

            SepalLength  SepalWidth  PetalLength  PetalWidth
Name
setosa            5.006       3.418        1.464       0.244
versicolor        5.936       2.770        4.260       1.326
virginica         6.588       2.974        5.552       2.026

In [46]:
#Let's average the SepalLength and sum up the SepalWidth
a = df1.groupby('Name').agg({'SepalLength':'mean','SepalWidth':'sum'})
a

            SepalLength  SepalWidth
Name
setosa            5.006       170.9
versicolor        5.936       138.5
virginica         6.588       148.7

In [45]:
#Let's rename columns for sanity
    a.rename(columns={'SepalLength':'Avg_SepalLength','SepalWidth':'Sum_SepalWidth'})

            Avg_SepalLength  Sum_SepalWidth
Name
setosa                5.006           170.9
versicolor            5.936           138.5
virginica             6.588           148.7

# 9. Subsetting dataframes

In [100]:
#Subset data in pandas based on condition
a = iris[(iris.SepalLength>7)]
a.head()

     SepalLength  SepalWidth  PetalLength  PetalWidth       Name
102          7.1         3.0          5.9         2.1  virginica
105          7.6         3.0          6.6         2.1  virginica
107          7.3         2.9          6.3         1.8  virginica
109          7.2         3.6          6.1         2.5  virginica
117          7.7         3.8          6.7         2.2  virginica

In [101]:
#Subset data in pandas based on two conditions
b = iris[(iris.SepalLength>5) & (iris.PetalLength>6)]
b.head()

     SepalLength  SepalWidth  PetalLength  PetalWidth       Name
105          7.6         3.0          6.6         2.1  virginica
107          7.3         2.9          6.3         1.8  virginica
109          7.2         3.6          6.1         2.5  virginica
117          7.7         3.8          6.7         2.2  virginica
118          7.7         2.6          6.9         2.3  virginica

In [102]:
#Subset only for one Species
c = iris[iris['Name']=='versicolor']
c.head()

    SepalLength  SepalWidth  PetalLength  PetalWidth        Name
50          7.0         3.2          4.7         1.4  versicolor
51          6.4         3.2          4.5         1.5  versicolor
52          6.9         3.1          4.9         1.5  versicolor
53          5.5         2.3          4.0         1.3  versicolor
54          6.5         2.8          4.6         1.5  versicolor

In [103]:
#Subset for two species
d=iris[iris['Name'].isin(['virginica','versicolor'])]
d.head()

    SepalLength  SepalWidth  PetalLength  PetalWidth        Name
50          7.0         3.2          4.7         1.4  versicolor
51          6.4         3.2          4.5         1.5  versicolor
52          6.9         3.1          4.9         1.5  versicolor
53          5.5         2.3          4.0         1.3  versicolor
54          6.5         2.8          4.6         1.5  versicolor

# 10. Pivot table in pandas

In [55]:
df1 = pd.read_csv('RealEstate.csv')
df1.head()

,MLS,Location,Price,Bedrooms,Bathrooms,Size,Price/SQ.Ft,Status
0,132842,Arroyo Grande,795000.0,3,3,2371,335.30,Short Sale
1,134364,Paso Robles,399000.0,4,3,2818,141.59,Short Sale
2,135141,Paso Robles,545000.0,4,3,3032,179.75,Short Sale
3,135712,Morro Bay,909000.0,4,4,3540,256.78,Short Sale
4,136282,Santa Maria-Orcutt,109900.0,3,1,1249,87.99,Short Sale

In [60]:
import numpy as np
df1.pivot_table(values='Price',index='Location',columns='Status',aggfunc=np.mean)

Status                Foreclosure       Regular    Short Sale
Location
 Arroyo Grande                NaN  1.013958e+06           NaN
 Atascadero                   NaN  4.779500e+05           NaN
 Bradley                      NaN  1.600000e+06           NaN
 Cambria                      NaN  1.076333e+06           NaN
 Cayucos                      NaN  6.100000e+05           NaN
 Creston                      NaN  5.490000e+05           NaN
 Grover Beach                 NaN  6.840000e+05           NaN
 Lompoc                       NaN  1.499000e+05           NaN
 Los Osos                     NaN  5.310000e+05           NaN
 Morro Bay                    NaN  6.597000e+05           NaN
 Nipomo                       NaN  4.541667e+05           NaN
 Oceano                       NaN  1.195000e+06           NaN
 Out Of Area                  NaN  1.195000e+06           NaN
 Paso Robles                  NaN  3.676267e+05           NaN
 Pismo Beach                  NaN  6.360375e+05           NaN
 San Luis Obispo              NaN  1.444667e+06           NaN
 San Miguel                   NaN  5.950000e+05           NaN
 Santa Maria-Orcutt           NaN  3.325461e+05           NaN
 Solvang                      NaN  3.250000e+05           NaN
 Templeton                    NaN  5.090000e+05           NaN
Arroyo Grande        4.851200e+05           NaN  5.483065e+05
Atascadero           4.958635e+05           NaN  3.944224e+05
Avila Beach          8.090000e+05           NaN  1.999000e+06
Bakersfield                   NaN           NaN  9.150000e+04
Bradley              1.949000e+05           NaN  4.740000e+05
Buellton             4.176750e+05           NaN  3.922500e+05
Cambria              4.204250e+05           NaN  4.436000e+05
Cayucos                       NaN           NaN  1.500000e+06
Coalinga                      NaN           NaN  2.020714e+05
Creston              3.099000e+05           NaN           NaN
Greenfield           1.848000e+05           NaN           NaN
Grover Beach         4.690000e+05           NaN  3.601737e+05
Guadalupe            9.400000e+04           NaN  1.250000e+05
King City            1.311900e+05           NaN           NaN
Lockwood                      NaN           NaN  4.250000e+05
Lompoc               2.204914e+05           NaN  2.654917e+05
Los Alamos                    NaN           NaN  3.980000e+05
Los Osos             5.709667e+05           NaN  3.244944e+05
Morro Bay            7.637800e+05           NaN  6.426250e+05
New Cuyama                    NaN           NaN  4.090000e+04
Nipomo               3.451286e+05           NaN  4.527963e+05
Oceano               1.625667e+05           NaN  4.912429e+05
Out Of Area                   NaN  1.739000e+05           NaN
Paso Robles          3.602556e+05           NaN  3.234572e+05
Pismo Beach          1.201998e+06           NaN  6.864500e+05
San Luis Obispo      3.395210e+05           NaN  5.047556e+05
San Miguel           3.382667e+05           NaN  2.687455e+05
San Simeon           2.749000e+05           NaN           NaN
Santa Margarita      5.990000e+04           NaN           NaN
Santa Maria-Orcutt   2.203925e+05  1.770000e+05  2.332609e+05
Santa Ynez           6.950000e+05           NaN  9.285000e+05
Soledad              1.840533e+05           NaN           NaN
Solvang              3.466000e+05           NaN  4.359800e+05
Templeton            9.329333e+05           NaN  6.207500e+05

# 11. Date functionality

In [61]:
import pandas as pd
import numpy as np

In [64]:
pd.Timestamp('8/2/2018 9:12PM')

Timestamp('2018-08-02 21:12:00')